<!-- 书本分类 -->
<template>
	<view class="book-classify">
		<!-- https://ext.dcloud.net.cn/plugin?id=4639 -->
		<dropdown-screen @finish="finish" class="dropdown-screen" :listArr="listArr" :itemArr="itemArr">
		</dropdown-screen>
		<book-card-item class="book-classify-item" :bookClassifyInfo="bookClassifyInfo"></book-card-item>
	</view>
</template>

<script>
	export default {
		data() {
			return {
				listArr: ['推荐指数', '下载量', '收藏'],
				itemArr: [
					[{
						text: '按推荐指数升序排序',
						vallue: 1
					}, {
						text: '按推荐指数降序排序',
						vallue: 2
					}],
					[{
						text: '按下载量升序排序',
						vallue: 3
					}, {
						text: '按下载量降序排序',
						vallue: 4
					}],
					[{
						text: '按收藏数量升序排序',
						vallue: 5
					}, {
						text: '按收藏数量降序排序',
						vallue: 6
					}]
				],
				bookClassifyInfo: [{
						id: 1,
						bookurl: '/subpkg/bookDetails/bookDetails',

						bookimg: 'http://img3m0.ddimg.cn/28/10/29137510-1_b_3.jpg',
						bookname: '阿里巴巴Java开发手册（第2版） 全球Java开发设计权威指南',
						bookintroduction: '本手册的愿景是码出高效，码出质量。它结合作者的开发经验和架构历程，提炼阿里巴巴集团技术团队的集体编程经验和软件设计智慧，浓缩成为立体的编程规范和*实践。众所周知，现代软件行业的高速发展对开发工程师的综合素质要求越来越高，因为不仅是编程相关的知识点，其他维度的知识点也会影响软件的*终交付质量，比如，数据库的表结构和索引设计缺陷可能带来软件的架构缺陷或性能风险；单元测试的失位导致系统集成测试困难；没有鉴权的漏洞代码易被黑客攻击等。所以，本手册以开发工程师为中心视角，划分为编程规约、异常日志、单元测试、安全规约、MySQL数据库、工程结构、设计规约七个维度，每个条目下提供相应的扩展解释和说明、正例和反例，全面、立体、形象地帮助开发工程师成长，有助于团队代码规约文化的形成。积小流成大海，积跬步至千里，在第1版基础上，认真倾听读者反馈，学习开源社区的详细建议，增加前后端规约，发布错误码解决方案，修正架构分层图例等相关内容，涉及59条新规约，修正202处原有规约，完善8个示例，是面向业界以来更为完善的版本。从严格意义上讲，本手册超越了Java语言本身，明确了作为一名合格开发工程师应该具备的基本素质，因此本手册适合计算机相关行业的管理者和研发人员、高等院校的计算机专业师生、求职者等阅读，希望成为大家如良师益友般的工作手册、工具书和床头书',
						bookauthor: '杨冠宝'
					}, {
						id: 2,
						bookurl: '/subpkg/bookDetails/bookDetails',

						bookimg: 'http://img3m0.ddimg.cn/28/10/29137510-1_b_3.jpg',
						bookname: '阿里巴巴Java开发手册（第2版） 全球Java开发设计权威指南',
						bookintroduction: '本手册的愿景是码出高效，码出质量。它结合作者的开发经验和架构历程，提炼阿里巴巴集团技术团队的集体编程经验和软件设计智慧，浓缩成为立体的编程规范和*实践。众所周知，现代软件行业的高速发展对开发工程师的综合素质要求越来越高，因为不仅是编程相关的知识点，其他维度的知识点也会影响软件的*终交付质量，比如，数据库的表结构和索引设计缺陷可能带来软件的架构缺陷或性能风险；单元测试的失位导致系统集成测试困难；没有鉴权的漏洞代码易被黑客攻击等。所以，本手册以开发工程师为中心视角，划分为编程规约、异常日志、单元测试、安全规约、MySQL数据库、工程结构、设计规约七个维度，每个条目下提供相应的扩展解释和说明、正例和反例，全面、立体、形象地帮助开发工程师成长，有助于团队代码规约文化的形成。积小流成大海，积跬步至千里，在第1版基础上，认真倾听读者反馈，学习开源社区的详细建议，增加前后端规约，发布错误码解决方案，修正架构分层图例等相关内容，涉及59条新规约，修正202处原有规约，完善8个示例，是面向业界以来更为完善的版本。从严格意义上讲，本手册超越了Java语言本身，明确了作为一名合格开发工程师应该具备的基本素质，因此本手册适合计算机相关行业的管理者和研发人员、高等院校的计算机专业师生、求职者等阅读，希望成为大家如良师益友般的工作手册、工具书和床头书',
						bookauthor: '杨冠宝'
					}, {
						id: 3,
						bookurl: '/subpkg/bookDetails/bookDetails',
						bookimg: 'http://img3m0.ddimg.cn/28/10/29137510-1_b_3.jpg',
						bookname: '阿里巴巴Java开发手册（第2版） 全球Java开发设计权威指南',
						bookintroduction: '本手册的愿景是码出高效，码出质量。它结合作者的开发经验和架构历程，提炼阿里巴巴集团技术团队的集体编程经验和软件设计智慧，浓缩成为立体的编程规范和*实践。众所周知，现代软件行业的高速发展对开发工程师的综合素质要求越来越高，因为不仅是编程相关的知识点，其他维度的知识点也会影响软件的*终交付质量，比如，数据库的表结构和索引设计缺陷可能带来软件的架构缺陷或性能风险；单元测试的失位导致系统集成测试困难；没有鉴权的漏洞代码易被黑客攻击等。所以，本手册以开发工程师为中心视角，划分为编程规约、异常日志、单元测试、安全规约、MySQL数据库、工程结构、设计规约七个维度，每个条目下提供相应的扩展解释和说明、正例和反例，全面、立体、形象地帮助开发工程师成长，有助于团队代码规约文化的形成。积小流成大海，积跬步至千里，在第1版基础上，认真倾听读者反馈，学习开源社区的详细建议，增加前后端规约，发布错误码解决方案，修正架构分层图例等相关内容，涉及59条新规约，修正202处原有规约，完善8个示例，是面向业界以来更为完善的版本。从严格意义上讲，本手册超越了Java语言本身，明确了作为一名合格开发工程师应该具备的基本素质，因此本手册适合计算机相关行业的管理者和研发人员、高等院校的计算机专业师生、求职者等阅读，希望成为大家如良师益友般的工作手册、工具书和床头书',
						bookauthor: '杨冠宝'
					}, {
						id: 4,
						bookurl: '/subpkg/bookDetails/bookDetails',

						bookimg: 'http://img3m0.ddimg.cn/28/10/29137510-1_b_3.jpg',
						bookname: '阿里巴巴Java开发手册（第2版） 全球Java开发设计权威指南',
						bookintroduction: '本手册的愿景是码出高效，码出质量。它结合作者的开发经验和架构历程，提炼阿里巴巴集团技术团队的集体编程经验和软件设计智慧，浓缩成为立体的编程规范和*实践。众所周知，现代软件行业的高速发展对开发工程师的综合素质要求越来越高，因为不仅是编程相关的知识点，其他维度的知识点也会影响软件的*终交付质量，比如，数据库的表结构和索引设计缺陷可能带来软件的架构缺陷或性能风险；单元测试的失位导致系统集成测试困难；没有鉴权的漏洞代码易被黑客攻击等。所以，本手册以开发工程师为中心视角，划分为编程规约、异常日志、单元测试、安全规约、MySQL数据库、工程结构、设计规约七个维度，每个条目下提供相应的扩展解释和说明、正例和反例，全面、立体、形象地帮助开发工程师成长，有助于团队代码规约文化的形成。积小流成大海，积跬步至千里，在第1版基础上，认真倾听读者反馈，学习开源社区的详细建议，增加前后端规约，发布错误码解决方案，修正架构分层图例等相关内容，涉及59条新规约，修正202处原有规约，完善8个示例，是面向业界以来更为完善的版本。从严格意义上讲，本手册超越了Java语言本身，明确了作为一名合格开发工程师应该具备的基本素质，因此本手册适合计算机相关行业的管理者和研发人员、高等院校的计算机专业师生、求职者等阅读，希望成为大家如良师益友般的工作手册、工具书和床头书',
						bookauthor: '杨冠宝'
					}, {
						id: 5,
						bookurl: '/subpkg/bookDetails/bookDetails',

						bookimg: 'http://img3m0.ddimg.cn/28/10/29137510-1_b_3.jpg',
						bookname: '阿里巴巴Java开发手册（第2版） 全球Java开发设计权威指南',
						bookintroduction: '本手册的愿景是码出高效，码出质量。它结合作者的开发经验和架构历程，提炼阿里巴巴集团技术团队的集体编程经验和软件设计智慧，浓缩成为立体的编程规范和*实践。众所周知，现代软件行业的高速发展对开发工程师的综合素质要求越来越高，因为不仅是编程相关的知识点，其他维度的知识点也会影响软件的*终交付质量，比如，数据库的表结构和索引设计缺陷可能带来软件的架构缺陷或性能风险；单元测试的失位导致系统集成测试困难；没有鉴权的漏洞代码易被黑客攻击等。所以，本手册以开发工程师为中心视角，划分为编程规约、异常日志、单元测试、安全规约、MySQL数据库、工程结构、设计规约七个维度，每个条目下提供相应的扩展解释和说明、正例和反例，全面、立体、形象地帮助开发工程师成长，有助于团队代码规约文化的形成。积小流成大海，积跬步至千里，在第1版基础上，认真倾听读者反馈，学习开源社区的详细建议，增加前后端规约，发布错误码解决方案，修正架构分层图例等相关内容，涉及59条新规约，修正202处原有规约，完善8个示例，是面向业界以来更为完善的版本。从严格意义上讲，本手册超越了Java语言本身，明确了作为一名合格开发工程师应该具备的基本素质，因此本手册适合计算机相关行业的管理者和研发人员、高等院校的计算机专业师生、求职者等阅读，希望成为大家如良师益友般的工作手册、工具书和床头书',
						bookauthor: '杨冠宝'
					},
					{
						id: 6,
						bookurl: '/subpkg/bookDetails/bookDetails',
						bookimg: 'http://img3m0.ddimg.cn/28/10/29137510-1_b_3.jpg',
						bookname: '阿里巴巴Java开发手册（第2版） 全球Java开发设计权威指南',
						bookintroduction: '本手册的愿景是码出高效，码出质量。它结合作者的开发经验和架构历程，提炼阿里巴巴集团技术团队的集体编程经验和软件设计智慧，浓缩成为立体的编程规范和*实践。众所周知，现代软件行业的高速发展对开发工程师的综合素质要求越来越高，因为不仅是编程相关的知识点，其他维度的知识点也会影响软件的*终交付质量，比如，数据库的表结构和索引设计缺陷可能带来软件的架构缺陷或性能风险；单元测试的失位导致系统集成测试困难；没有鉴权的漏洞代码易被黑客攻击等。所以，本手册以开发工程师为中心视角，划分为编程规约、异常日志、单元测试、安全规约、MySQL数据库、工程结构、设计规约七个维度，每个条目下提供相应的扩展解释和说明、正例和反例，全面、立体、形象地帮助开发工程师成长，有助于团队代码规约文化的形成。积小流成大海，积跬步至千里，在第1版基础上，认真倾听读者反馈，学习开源社区的详细建议，增加前后端规约，发布错误码解决方案，修正架构分层图例等相关内容，涉及59条新规约，修正202处原有规约，完善8个示例，是面向业界以来更为完善的版本。从严格意义上讲，本手册超越了Java语言本身，明确了作为一名合格开发工程师应该具备的基本素质，因此本手册适合计算机相关行业的管理者和研发人员、高等院校的计算机专业师生、求职者等阅读，希望成为大家如良师益友般的工作手册、工具书和床头书',
						bookauthor: '杨冠宝'
					},
					{
						id: 6,
						bookurl: '/subpkg/bookDetails/bookDetails',
						bookimg: 'http://img3m0.ddimg.cn/28/10/29137510-1_b_3.jpg',
						bookname: '阿里巴巴Java开发手册（第2版） 全球Java开发设计权威指南',
						bookintroduction: '本手册的愿景是码出高效，码出质量。它结合作者的开发经验和架构历程，提炼阿里巴巴集团技术团队的集体编程经验和软件设计智慧，浓缩成为立体的编程规范和*实践。众所周知，现代软件行业的高速发展对开发工程师的综合素质要求越来越高，因为不仅是编程相关的知识点，其他维度的知识点也会影响软件的*终交付质量，比如，数据库的表结构和索引设计缺陷可能带来软件的架构缺陷或性能风险；单元测试的失位导致系统集成测试困难；没有鉴权的漏洞代码易被黑客攻击等。所以，本手册以开发工程师为中心视角，划分为编程规约、异常日志、单元测试、安全规约、MySQL数据库、工程结构、设计规约七个维度，每个条目下提供相应的扩展解释和说明、正例和反例，全面、立体、形象地帮助开发工程师成长，有助于团队代码规约文化的形成。积小流成大海，积跬步至千里，在第1版基础上，认真倾听读者反馈，学习开源社区的详细建议，增加前后端规约，发布错误码解决方案，修正架构分层图例等相关内容，涉及59条新规约，修正202处原有规约，完善8个示例，是面向业界以来更为完善的版本。从严格意义上讲，本手册超越了Java语言本身，明确了作为一名合格开发工程师应该具备的基本素质，因此本手册适合计算机相关行业的管理者和研发人员、高等院校的计算机专业师生、求职者等阅读，希望成为大家如良师益友般的工作手册、工具书和床头书',
						bookauthor: '杨冠宝'
					},
					{
						id: 6,
						bookurl: '/subpkg/bookDetails/bookDetails',
						bookimg: 'http://img3m0.ddimg.cn/28/10/29137510-1_b_3.jpg',
						bookname: '阿里巴巴Java开发手册（第2版） 全球Java开发设计权威指南',
						bookintroduction: '本手册的愿景是码出高效，码出质量。它结合作者的开发经验和架构历程，提炼阿里巴巴集团技术团队的集体编程经验和软件设计智慧，浓缩成为立体的编程规范和*实践。众所周知，现代软件行业的高速发展对开发工程师的综合素质要求越来越高，因为不仅是编程相关的知识点，其他维度的知识点也会影响软件的*终交付质量，比如，数据库的表结构和索引设计缺陷可能带来软件的架构缺陷或性能风险；单元测试的失位导致系统集成测试困难；没有鉴权的漏洞代码易被黑客攻击等。所以，本手册以开发工程师为中心视角，划分为编程规约、异常日志、单元测试、安全规约、MySQL数据库、工程结构、设计规约七个维度，每个条目下提供相应的扩展解释和说明、正例和反例，全面、立体、形象地帮助开发工程师成长，有助于团队代码规约文化的形成。积小流成大海，积跬步至千里，在第1版基础上，认真倾听读者反馈，学习开源社区的详细建议，增加前后端规约，发布错误码解决方案，修正架构分层图例等相关内容，涉及59条新规约，修正202处原有规约，完善8个示例，是面向业界以来更为完善的版本。从严格意义上讲，本手册超越了Java语言本身，明确了作为一名合格开发工程师应该具备的基本素质，因此本手册适合计算机相关行业的管理者和研发人员、高等院校的计算机专业师生、求职者等阅读，希望成为大家如良师益友般的工作手册、工具书和床头书',
						bookauthor: '杨冠宝'
					},

					{
						id: 6,
						bookurl: '/subpkg/bookDetails/bookDetails',
						bookimg: 'http://img3m0.ddimg.cn/28/10/29137510-1_b_3.jpg',
						bookname: '阿里巴巴Java开发手册（第2版） 全球Java开发设计权威指南',
						bookintroduction: '本手册的愿景是码出高效，码出质量。它结合作者的开发经验和架构历程，提炼阿里巴巴集团技术团队的集体编程经验和软件设计智慧，浓缩成为立体的编程规范和*实践。众所周知，现代软件行业的高速发展对开发工程师的综合素质要求越来越高，因为不仅是编程相关的知识点，其他维度的知识点也会影响软件的*终交付质量，比如，数据库的表结构和索引设计缺陷可能带来软件的架构缺陷或性能风险；单元测试的失位导致系统集成测试困难；没有鉴权的漏洞代码易被黑客攻击等。所以，本手册以开发工程师为中心视角，划分为编程规约、异常日志、单元测试、安全规约、MySQL数据库、工程结构、设计规约七个维度，每个条目下提供相应的扩展解释和说明、正例和反例，全面、立体、形象地帮助开发工程师成长，有助于团队代码规约文化的形成。积小流成大海，积跬步至千里，在第1版基础上，认真倾听读者反馈，学习开源社区的详细建议，增加前后端规约，发布错误码解决方案，修正架构分层图例等相关内容，涉及59条新规约，修正202处原有规约，完善8个示例，是面向业界以来更为完善的版本。从严格意义上讲，本手册超越了Java语言本身，明确了作为一名合格开发工程师应该具备的基本素质，因此本手册适合计算机相关行业的管理者和研发人员、高等院校的计算机专业师生、求职者等阅读，希望成为大家如良师益友般的工作手册、工具书和床头书',
						bookauthor: '杨冠宝'
					}, {
						id: 6,
						bookurl: '/subpkg/bookDetails/bookDetails',
						bookimg: 'http://img3m0.ddimg.cn/28/10/29137510-1_b_3.jpg',
						bookname: '阿里巴巴Java开发手册（第2版） 全球Java开发设计权威指南',
						bookintroduction: '本手册的愿景是码出高效，码出质量。它结合作者的开发经验和架构历程，提炼阿里巴巴集团技术团队的集体编程经验和软件设计智慧，浓缩成为立体的编程规范和*实践。众所周知，现代软件行业的高速发展对开发工程师的综合素质要求越来越高，因为不仅是编程相关的知识点，其他维度的知识点也会影响软件的*终交付质量，比如，数据库的表结构和索引设计缺陷可能带来软件的架构缺陷或性能风险；单元测试的失位导致系统集成测试困难；没有鉴权的漏洞代码易被黑客攻击等。所以，本手册以开发工程师为中心视角，划分为编程规约、异常日志、单元测试、安全规约、MySQL数据库、工程结构、设计规约七个维度，每个条目下提供相应的扩展解释和说明、正例和反例，全面、立体、形象地帮助开发工程师成长，有助于团队代码规约文化的形成。积小流成大海，积跬步至千里，在第1版基础上，认真倾听读者反馈，学习开源社区的详细建议，增加前后端规约，发布错误码解决方案，修正架构分层图例等相关内容，涉及59条新规约，修正202处原有规约，完善8个示例，是面向业界以来更为完善的版本。从严格意义上讲，本手册超越了Java语言本身，明确了作为一名合格开发工程师应该具备的基本素质，因此本手册适合计算机相关行业的管理者和研发人员、高等院校的计算机专业师生、求职者等阅读，希望成为大家如良师益友般的工作手册、工具书和床头书',
						bookauthor: '杨冠宝'
					},
				]
			};
		},
		onLoad() {
			uni.setNavigationBarTitle({
				title: 'Java'
			})
		},
		methods: {
			finish(e) {
				console.log(e)
			}
		}
	}
</script>

<style lang="scss">
	.book-classify {
		width: 100%;
		margin-top: 44px;

		.book-classify-item {
			width: 90%;
		}

		.dropdown-screen {
			position: fixed;
			left: 0;
			top: 0;
			width: 100%;
		}
	}
</style>
